{
  "url": "https://www.xach.com/naggum/articles/3155808540636802@naggum.no.html",
  "id": "3155808540636802@naggum.no",
  "title": "Re: lisp compiler",
  "content": "\nSubject: Re: lisp compiler\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/01/02\nNewsgroups: comp.lang.lisp\nMessage-ID: <3155808540636802@naggum.no>\n\n* \"Janos Blazi\" <jblazi@netsurf.de>\n| But don't they say it becomes invalid after a month?\n\n  didn't your parents feed you enough for your brain to develop?\n\n  in case you don't like the question, consider what it communicates about\n  you.  then consider what your question communicates about Franz Inc and\n  their free (gratis) versions of Allegro CL.  if you see a reason for you\n  to be annoyed by my question, but not any reason for anybody to be\n  annoyed by your question, consider suing your parents for malnutrition.\n  \n  nothing \"becomes invalid\" (even allowing for extremely poor grasp of\n  English).  the licence is clear: Allegro CL Trial Edition for Linux and\n  Lite Edition for Windows is licensed for use by anyone who gets a copy of\n  it up until 2000-11-01.  it's like the Y2K \"problem\": nothing happens.\n  if you think this means you may continue to use it, the answer is the\n  same as to whether committing crimes in ways that makes you believe you\n  won't get caught is legal.  (in case that's too difficult for you: no,\n  you may not use it after 2000-11-01, but the software itself won't\n  enforce the license agreement.)  like all honor-based systems, they may\n  have to change if a sufficient number of morons violate it, and that is\n  why the memory limitations were changed between 5.0 and 5.0.1: too many\n  idiots tried to use the free version in production systems without paying\n  for a license, so those who would like to play with a free version and\n  complex applications got a problem.  it's always like this: idiots make\n  intelligent people lose freedom, time or money.  this is of course\n  acceptable to the idiots.  this is also why most postings by Janos Blazi\n  are NOT acceptable.\n\n#:Erik\n\n",
  "date": "2000-01-02",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}