{
  "url": "https://www.xach.com/naggum/articles/3156359331778161@naggum.no.html",
  "id": "3156359331778161@naggum.no",
  "title": "Re: Comparison of LISP Compilers and translators",
  "content": "\nSubject: Re: Comparison of LISP Compilers and translators\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/01/08\nNewsgroups: comp.lang.lisp\nMessage-ID: <3156359331778161@naggum.no>\n\n* lisp_lover@my-deja.com\n| I am interested in asking the opinion of the readership of this newsgroup\n| on the subject of this post.\n\n  this goes without saying, really.\n\n| Is a converter to C better than a compiler?\n\n  no.\n\n| I am looking for a free OR commercial product that runs on linux and has\n| source code.  It should interface with X if it is gui.\n\n  how much source code?  all of it?  if so, why?  I have all the source\n  code to the Linux kernel and almost all the Linux tools, and yet I find\n  it nearly unreadable and almost completely useless.  investing the time\n  it takes to understand a piece of source code in order to modify a tool\n  is a decision that should be made after investigating the needs and the\n  options very closely.  the probability that the effort will be worth it\n  is very slim, indeed.  having the _option_ to do so in a particular case,\n  is, however, priceless.  this means you would want the source to specific\n  fragments of the entire system as you encounter specific problems.  this\n  will be easy to come by if you're a paying customer.\n\n| AT EVERY STAGE, IF THE PREPARATION IS CORRECT, ONE CAN READILY PERCEIVE\n| THE NEXT STAGE OF KNOWLEDGE.  THIS IS MY EXPERIENCE WITH LEARNING\n| RELATIVITY, AND QUANTUM MECHANICS.  I SAW INTELLECTUALLY PERVERTED,\n| MASOCHISTIC, TRECHEROUS AND HIGHLY COMPETETIVE PROFS AT MIT AND CALTECH\n| WHO WOULD WRITE BOOKS FOR _IMPRESSING THEIR COLLEGUES_ AND AT THE SAME\n| TIME MAKING MONEY.  READING THE REVIEWS ON STRUCTURE AND INTERPRETATION\n| OF COMPUTER PROGRAMS AT AMAZON, IT SEEMS THAT THE BOOK WAS WRITTEN BY\n| THESE POMPOUS PEOPLE FROM SNOBISH MIT TO IMPRESS THEIR COLLEAGUES.  THUS\n| I WANT PEOPLE NOT TO MISGUIDE ME TOWARDS SUCH BOOKS AND PAPERS. ANYWAY\n| COMING BACK TO THE SUBJECT, A FEW QUESTIONS.\n\n1 writing in capital letters is reserved for lawyers and retards.\n\n2 judgmental attitudes are severely incompatible with learning.\n\n3 SICP is intended to teach _programming_ to fairly intelligent people.  it\n  is very good at that.  less intelligent people struggle, but love it if\n  they have indeed struggled.  most people who want to learn \"programming\"\n  these days are fairly stupid and are mainly interested in making quick\n  bucks through an activity whose similarity to programming is restricted\n  to looking at a computer monitor.\n\n4 you're the only person so far who comes across as pompous.\n\n| Where can we get this and other MIT memo's for free?  I have enough money\n| for compiler but these publicly funded reports should be available free.\n\n  MIT was a private institution last time I checked.  has that changed?\n\n| I wish I could remember the honeywell reference, but I will inform the\n| readership of cll as soon as I find it.\n\n  most people here know about this reference, already.  just like Alexander\n  Graham Bell didn't invent the telephone and Thomas Alva Edison didn't\n  invent the light bulb, Richard Stallman didn't first use Lisp in Emacs.\n  he did, however, invent Emacs (based on TECO), and took great advantage\n  of the few first steps towards a Lisp-based Emacs made elsewhere and made\n  it what it is today.\n\n  it's actually quite arrogant of you to believe that you are the first\n  person to have come across a report that you think is \"damaging\" to Lisp\n  because you know so little.\n\n  I suggest the following:\n\n1 tune down the attitude to approximately zero\n\n2 read SICP for yourself -- it's a widely acclaimed book\n\n3 hold the judgment until you know of what you speak\n\n4 check your facts and references before you post them\n\n5 re-examine your needs -- and make them practical if they are political\n\n#:Erik\n\n",
  "date": "2000-01-08",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}