{
  "url": "https://www.xach.com/naggum/articles/3157793707546559@naggum.no.html",
  "id": "3157793707546559@naggum.no",
  "title": "Re: [Q] More beginner help",
  "content": "\nSubject: Re: [Q] More beginner help\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/01/25\nNewsgroups: comp.lang.lisp\nMessage-ID: <3157793707546559@naggum.no>\n\n* Dirt <pip3@inam3.com> -> Robert Monfera\n| I find it quite discouraging to see comments such as yours. Is this\n| not a learning enviroment?  Don't ask!! Don't learn!! Your Bad!!!\n\n  attempting to use USENET for homework has long traditions and only\n  marginally shorter traditions of rebuke, hostile reactions, and general\n  ill feelings in return.  when you ask for help in solving really simple\n  problems that any good textbook alredy explains well, you're putting\n  yourself in the homework category, whether you are doing homework on the\n  Net or not.  defensive reactions _reinforce_ that impression strongly.\n\n  if you want to learn something from the net, be prepared to listen to\n  _all_ the answers you get.  criticism is always well intended at first,\n  but the stupid, destructive people who insist on defending themselves\n  whenever something they do is criticized and on attacking people \"back\"\n  who never actually attacked them, make this a very strenous medium for\n  such people.  you see, people who are attacked this way are _not_ going\n  to give you any benefit of the doubt: you are clearly guilty of hostile\n  activities towards others, and if you respond strongly to such attacks,\n  so will everybody else.  if you feel unfairly attacked, consider the fact\n  that you attack others unfairly on purpose when you attack them for\n  having behaved badly towards you.  in short, stupid people escalate a\n  normal process of mild correction and attitude readjustment into flames\n  and out-and-out hostilities.  the solution is obvioulsy to get rid of the\n  stupid people, but until we can do that, all we can do is ask people to\n  stop behaving stupidly.\n\n  instead of getting worked up over criticism you don't understand, strive\n  to understand what made it arise in the first place.  most of the time,\n  it has simple, straightforward reasons that you can easily change, and\n  which it would be incredibly stupid of you not to change, because that\n  means you don't listen and really _are_ stupid, like one particular dude\n  here who never listens to anything he doesn't already agree to, and who\n  accuses those who try to readjust his attitude of being psychopaths and\n  maniacs, which only proves that he's just as retarded as they think he is.\n\n  incidentally, this is not really a learning environment.  it's really an\n  environment for sharing ideas and experiences with others.  the helping\n  and _learning_ part is the result of motivating those who have something\n  that you need to share it.  you don't do that by looking like you're\n  doing homework on the Net.  you can't change that by accusing people of\n  holding stupid attitudes like \"Don't ask!! Don't learn!! Your Bad!!\".\n\n  so wise up, and behave like you're asking and learning and taking part in\n  this environment, not just exploiting it and wasting people's time by not\n  doing your homework _between_ articles you post to this forum.  note the\n  \"behave like\" -- nobody cares what you actually _do_ or _think_, as they\n  can't see that in your articles and can't react to it unless they make\n  the grave error of pretending to see people's thoughts across the net.\n  (do notice how you make this mistake.)\n\n#:Erik\n\n",
  "date": "2000-01-25",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}