{
  "url": "https://www.xach.com/naggum/articles/3158009696783450@naggum.no.html",
  "id": "3158009696783450@naggum.no",
  "title": "Re: reading/writing bytes smaller than 8 bits?",
  "content": "\nSubject: Re: reading/writing bytes smaller than 8 bits?\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/01/28\nNewsgroups: comp.lang.lisp\nMessage-ID: <3158009696783450@naggum.no>\n\n* Marco Antoniotti <marcoxa@parades.rm.cnr.it>\n| The question I had in mind was: can Harlequin implement the API described\n| in a Franz Copyrighted document?\n\n  this \"question\" is an insult to people who provide information to the\n  community.  just because they see no reason to give away everything and\n  every right to their work does not mean that they are bastards out to\n  control people's reasonable courses of action.  copyright is a fairly\n  well-defined legal concept -- it does not preclude understanding and\n  using the information and ideas whose expression is protected from\n  reproduction, and never has precluded such use.  in particular, copyright\n  does not affect the implementability of a specification.\n\n| This is what I read here.  Apologies if my question was too concise.\n\n  I really think you need to study some copyright law.  unfounded fears\n  such as the ones you have expressed can lead to no good, especially if\n  they go unchecked and you actually believe that affixing a copyright\n  notice to a specification has any bearing on its implementability.\n\n  sometimes, I wonder if the reason people favor free software is that they\n  have zero clue about the freedoms and rights they actually _have_ within\n  the boundaries of intellectual property law, and maybe the bone-headed\n  intellectual-property lawyers of, say, DVD-CCA, tend to reinforce their\n  fears, too, but hysterics like fearing that a copyright notice would not\n  allow others to implement the functions described in a document, _could_\n  explain why people who want source code to everything consistently fail\n  to grasp the meaning of \"license\", in particular, that the GPL is in fact\n  a _license_ that grants them a bunch of rights they otherwise do not\n  have, and that if they are not granted all these rights by the only legal\n  entity that can grant them, they are in fact violating intellectual\n  property laws, whether they get prosecuted for it or not, or, indeed,\n  whether they are cast as world-class heroes for it or not.  arguing such\n  topics requires people to know the rights they have _under_ the law --\n  intellectual property is one of those areas where the law grants rights\n  that cannot be abridged by contract or agreement.  few \"freedom fighters\"\n  realize that they are often storming open doors and fighting for what\n  they already have.  some \"freedom fighters\" implicitly accuse others of\n  denying them rights they cannot be denied, except to the degree that they\n  willfully reject the option of exercising them, for which hardly anyone\n  else can be held responsible.\n\n  a population which has natural rights and has also been granted rights\n  under the law, but which is so ignorant of their rights that they believe\n  anyone can take them away from them at will, will live in such fear of\n  the law itself that both rights and law lose their meaning.  this is what\n  is happening to the ignorant hacker community, quite unlike what _could_\n  happen to the knowledgeable hackers of only a few years past.  \"ignorance\n  of the law is no excuse\" cuts both ways.  incompetence in the search for\n  freedom will only cause them to find the freedom to be incompetent.\n  \n#:Erik\n\n",
  "date": "2000-01-28",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}