{
  "url": "https://www.xach.com/naggum/articles/3159728087248949@naggum.no.html",
  "id": "3159728087248949@naggum.no",
  "title": "Re: Are there any LISP development systems that are VC, or other GUI    IDE  like?",
  "content": "\nSubject: Re: Are there any LISP development systems that are VC, or other GUI    IDE  like?\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/02/16\nNewsgroups: comp.lang.lisp\nMessage-ID: <3159728087248949@naggum.no>\n\n* Robert Posey <muddy@raytheon.com>\n| I agree with you about what should be done, unfortunately I work for very\n| large company where I am totally unable to affect hiring policies.\n\n  what part do you agree with?  I'm talking about _educating_ people that\n  have already been hired, because whatever was hired was raw material, and\n  education is what shapes them into something the company can use.\n\n| Being passionate is not excuse for lack of ability to make rational\n| arguments,\n\n  you extrapolate from unwillingness to treat a bozo like you as an adult\n  with _ability_ to make rational arguments.  this is a _fantastically_\n  unintelligent extrapolation.\n\n| when people let their emotions control them,\n\n  emotions always control people.  that's their fundamental function.  the\n  question is _which_ emotions.  some day you will understand this.\n\n| I never mean to say that they shouldn't feel strongly, but that shouldn't\n| blind them to both sides of an issue.\n\n  what does it _take_ to make you understand that you're the one dreaming\n  up this utter crap about other people?  I have told you that I can see\n  _some_ advantages with _everything_.  _why_ is this something you have to\n  keep denying all the time?  nobody here is blinded, except you, perhaps.\n\n| To become so emotionally attached to a EDITOR is a problem.\n\n  you don't understand how emotions work in technically apt people, so now\n  it's a \"problem\".  grrrrreat!  tell you wat, bozo, _nobody_ is _attached_\n  to an editor, emotionally or otherwise.  you don't have to be _attached_\n  to feel something, you see.  well, perhaps you do, but you're not the\n  prototype of all people on earth, now, are you?\n\n| If any complain about EMACS drives them to attack the  the commentator,\n| they have lost touch with reality.  EMACS is a fine program, BUT many\n| people hate EMACS with equal passion.  When you allow your emotion to so\n| blind to other points of view, your engineering ability has been\n| severely compromised.\n\n  *sigh*.  if only you could listen to yourself instead of expecting that\n  others will listen to you.  _nobody_ suffers from what you would dearly\n  hope they suffer from so _you_ could ignore them.  and I mean _nobody_.\n  you don't understand jack shit about software and how it affects people\n  with a working intelligence _and_ working emotions.  as soon as you\n  realize this, you could be worth talking to.  so far, there is no sign\n  that your brain is able to accept anything you don't already agree to.\n\n| If you think the widely \n| recognized relatively steep initial learning curve of EMACS doesn't exist you\n| have lost all touch with reality.\n\n  are you in really touch with Reality, \"Muddy\"?  whoever _actually_ thinks\n  these things you dream up?  I keep telling you: nobody.  your enemies are\n  figments of your not very well developed imagination.\n\n| However, to assert that none of my arguments are valid...\n\n  nobody has asserted any such thing.\n\n| However, the paranoid of the EMACS Zealots has made them see things that\n| aren't there.\n\n  _really_?  how about the many demonstrations that you are arguing against\n  some really stupid stuff that _nobody_ has actually ever said?\n\n| Read my posting again, and see if I ever said anything to justify the\n| reactions people made.\n\n  just _how_ stupid are you, \"Muddy\"?  do you really think nobody did that\n  _before_ they reacted to your incredibly retarded and unfounded opinions?\n\n| >   by the way, wishful thinking like \"there's something wrong with those who\n| >   hate me\" is a very useful psychological defense mechanism for those who\n| >   are mentally unprepared to accept that other people aren't hateful to\n| >   begin with and don't react without reason or observable cause.  it is\n| >   fairly interesting to watch people respond to criticism as if criticism\n| >   of _them_ has to come from psychopaths, while they are eminently able to\n| >   criticize just about anything, usually without justifiable reasons.\n| \n| If any of you hate me for my comments you need serious help.\n\n  I'm _amazed_ by your reading comprehension, \"Muddy\".  I said \"[you] are\n  mentally unprepared to accept that other people aren't hateful to begin\n  with\", and now your response proves just that.\n\n  you're an idiot, Robert Posey.  shut your trap and leave us alone.\n\n#:Erik\n\n",
  "date": "2000-02-16",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}