{
  "url": "https://www.xach.com/naggum/articles/3159474410537964@naggum.no.html",
  "id": "3159474410537964@naggum.no",
  "title": "Re: reading/writing bytes smaller than 8 bits?",
  "content": "\nSubject: Re: reading/writing bytes smaller than 8 bits?\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/02/13\nNewsgroups: comp.lang.lisp\nMessage-ID: <3159474410537964@naggum.no>\n\n* Marco Antoniotti <marcoxa@parades.rm.cnr.it>\n| Now the question for you is: is this a \"legitimate\" issue to raise?\n\n  implementing a standard is always voluntary.  this may annoy some people\n  (it annoys me _greatly_ at times, like when the stupid Norwegian Language\n  Council incredulously insists on writing \"13.2.00\" for today, for the\n  single, simple, stupid reason that the Swedes write \"2000-02-13\", and we\n  can't do anything the Swedes do unless it's really stupid and then not\n  until they figured out that it was stupid and did something else that we\n  obviously can't do at that point, but I digress irresponsibly).  even\n  when some proposal is put into a standard, the user community has to be\n  responsible and take issue with half-witted or bogus implementations.\n\n| > I really think you need to study some copyright law.\n| \n| Yes and no.  I can just ask you :)\n\n  yikes!  like most other people who give legal advice on the Net, what I\n  have said on legal matters have turned out to be wrong at some later\n  date, so this is an almost _frightening_ level of \"trust\".  like the\n  other day, British authorities came up with this bill that would make it\n  illegal _not_ to decode files or messages stored on your computer, as if\n  the bloody obvious assault on every citizen's assumption of innocence\n  until proven guilty would _not_ be to store files or messages on their\n  computer to which they did not in fact _have_ a decoding key.  the police\n  often plant evidence in drug cases to incarcerate people they just don't\n  like, and now they can do the same with computer people they just don't\n  like.  however, a few weeks ago, I would have said this was impossible to\n  implement under the European Human Rights Convention, but what do you\n  know?  I was wrong: in the interest of removing personal freedom and\n  security from people's lives when they do something politicians are\n  afraid of out of sheer, mind-numbing ignorance, _anything_ goes, and\n  _anywhere_ in the world, even England, with their Magna Carta heritage.\n\n#:Erik\n\n",
  "date": "2000-02-13",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}