{
  "url": "https://www.xach.com/naggum/articles/3159558414867232@naggum.no.html",
  "id": "3159558414867232@naggum.no",
  "title": "Re: Are there any LISP development systems that are VC, or other GUI  IDE  like?",
  "content": "\nSubject: Re: Are there any LISP development systems that are VC, or other GUI  IDE  like?\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/02/14\nNewsgroups: comp.lang.lisp\nMessage-ID: <3159558414867232@naggum.no>\n\n* Robert Posey <muddy@raytheon.com>\n| You are now my new Newsgroups Closed Mind of Year.\n\n  I just knew you were the authority on Closed Minds.\n\n| I guess you must feel really threaten that more people can use computers\n| without the high initial price.\n\n  at least your guesses are improving in quality -- now you make them about\n  issues on which you at least have relevant personal experience.\n\n| Technology is not a social club, it should always be made as easy to use\n| as possible.\n\n  sure.  but not easier, as the genius once said.\n\n| If you really think anyone would doesn't want to waste time learning\n| painfully complex tools for every new task is a loser, you need to\n| reconsider the task.\n\n  only someone who confuses a particular implementation of an idea with the\n  idea itself could say something so utterly devoid of intelligence.\n\n| If this crazed rant is a result of some deep emotion attachment to EMACS,\n| GET A LIFE.\n\n  and just what made you think in terms of deep emotional attachment, Robert?\n\n| Any learning curve time that involves the tool is wasted time, and should\n| be minimized.\n\n  _very_ good advice.  and it has evidently worked wonders for you.\n\n| After this incredible childish response, you would dare to tell me what\n| to do.\n\n  children are supposed to be told what to do, but the stubbornness that\n  causes children to do the opposite of what they are told, no matter how\n  foolish or stupid, is the very definition of a childish reaction to being\n  told what to do.  so why don't you do something to convince me that _I_\n  would benefit from talking to like you were an adult?  so far, you have\n  respond _solely_ on what _you_ see as childish, and nothing else.  if you\n  don't want to be treated as a stupid child, well, do something else.  how\n  hard can it be?  (and if it _is_ too hard for you, perhaps that's a clue?)\n\n| The very idea I can't comment about the faults that must exist in any\n| software is a joke.\n\n  sure is, but you're the first to make that joke.  I must assume it made\n  you laugh to yourself because it's tragically unfunny to anyone else.\n\n| Your response is paranoid in the extreme, LISP and EMACS aren't a\n| religion so chill out.\n\n  so just what _are_ you so mortally afraid of, Robert, that this is what\n  you consider most helpful to your cause?\n\n| All editors, languages and people have flaws and to pretend different\n| makes you look foolish.\n\n  definitiely, but what about you, who actually _think_ people pretend\n  something so foolish?\n  \n| This is another example of one of the problems in EMACS, LINUX and I\n| guess LISP community, the desire to demonize the other side.\n\n  and here I was under the impression that we learned this from you, but I\n  guess you know the Emacs, Linux and Common Lisp communities better than\n  anyone who is actually a member of any of them, and you certainly know\n  them far better than you know the community you came from, such that you\n  don't for a minute hesitate to extrapolate your expectations from your\n  home community to _all_ others without checking or waiting to see that\n  what you believe holds for the new and different communities you meet.\n\n| Either you like doing it MY WAY or you are stupid and part of the Grand\n| Microsoft plot to take over the world.\n\n  see?  I _knew_ you had \"demonize\" written all over you.  nobody thinks\n  like this, Robert, except morons who actually believe that accusations\n  such as that one reflects on anyone but themselves.  but yes, I do think\n  you're terribly stupid.  it has nothing to do with doing anything my way\n  or not, but rather the insistence that _you_ want things your way or not\n  at all.  objects reflected in your PC screen are closer than they appear.\n\n| I would also challenge you to write a few programs with VC or Visual\n| Basic and see if you don't find some advantages.\n\n  trust me, I'm so smart I can find _some_ advantages with absolutely\n  anything, including killing people, using Perl, starting wars, installing\n  Windows on a would-be computer, or even help funding George W. Bush's\n  presidential campaign (he's _almost_ as clueless and negative about stuff\n  he doesn't grasp as you are), but that also means I'm so smart I can find\n  fundamental disadvantages that I don't want to pay for by the few, and by\n  now comparatively _irrelevant_ advantages I find.  you see, unlike you,\n  smart people weigh costs and benefits, they don't just go for whatever\n  has _some_ advantages.\n\n| I will admit if you spend a lot of time customizing EMACS it maybe better\n| than VS or any other product.\n\n  now, why would you \"admit\" that?  how would you know?  what else that you\n  know nothing about do you \"admit\"?  don't flatter yourself by pretending\n  to flatter me with superficial agreement to statements the ramifications\n  of the contents of which you cannot realize at your level of competence.\n  and I'm your Newsgroups Closed Mind of the Year, remember?  as such, I'm\n  certainly not open to your admissions of ignorance disguised as groveling.\n\n| I will admit you pissed me off, for which I beg forgiveness for lack of\n| emotional control.\n\n  nah, I don't forgive people.  I wait until they stop doing what they beg\n  forgiveness for, and shoot them down again if they repeat it, especially\n  after they have begged forgiveness for it, because that means they have\n  not learned, and not learning when you have the opportunity is the only\n  unforgivable sin.  and, _actually_, begging forgiveness is the hallmark\n  of someone who is going to repeat the same sin over and over again.\n\n| However, either you are having a bad day, or you have some deep hurts you\n| need to deal with.\n\n  sure.  I'll happily yield to your profound expertise in this area, too.\n\n  next time, try to speak _explicitly_ for yourself on psychological\n  matters, Robert, since that is what you are _implicitly_ doing, anyway.\n\n  good luck, \"Muddy\".\n\n#:Erik\n\n",
  "date": "2000-02-14",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}