{
  "url": "https://www.xach.com/naggum/articles/3159496965766379@naggum.no.html",
  "id": "3159496965766379@naggum.no",
  "title": "Re: Are there any LISP development systems that are VC, or other GUI IDE  like?",
  "content": "\nSubject: Re: Are there any LISP development systems that are VC, or other GUI IDE  like?\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/02/14\nNewsgroups: comp.lang.lisp\nMessage-ID: <3159496965766379@naggum.no>\n\n* Robert Posey\n| Actual EMACS is the worst, since it not delivered with a lot of the\n| packages you are going to need.\n\n  nonono, _you_ are the worst, since you have been delivered with a lot of\n  opinions instead of appreciation for the facts you would have needed to\n  form them.\n\n| EMACS would be improved 200% if someone would just modify the interface\n| packages so that they would install using a point and click installer\n| program.\n\n  most users would be improved 200% if someone just replaced their concepts\n  of what \"simplicity\" is all about with something approaching intelligence\n  in design.\n\n  also, I think children should come with little infrared receptors that\n  obeyed the \"mute\" button on my remote control, so now I'm going to\n  complain vociferously to everybody who make children that they should\n  improve their children 200% by changing them so the remote control I use\n  to shut up TV commercials will work on annoying children, too.\n\n  try M-x customize RET the next time you feel like pointing and clicking.\n  if that doesn't help, do something entirely new and different, and RTFM.\n\n  incidentally, there _are_ good IDEs for Common Lisp, too, but I surmise\n  that your penchant for complaining out of ignorance will apply yet again,\n  so I won't harm the vendors of such IDEs by naming them so you can post\n  yet more negative drivel about stuff you don't understand.  figure it out\n  for yourself -- you need to get used to figuring things out for yourself.\n\n  and while I'm speaking my mind, the reason intelligent, competent people\n  hate Microsoft is that that company alone has produced millions of people\n  just like you who have zero clue and an overpowering desire to prove it\n  to the entire world.  \"make a tool a fool can use, and only a fool will\n  use it\" has never been truer than of the anti-educational, anti-skill-\n  building cruftware that Microsoft has made billions peddling to unwitting\n  losers who now think they have a clue about using computers productively\n  (which is very different from fooling around with them all day).  they\n  don't, and thanks to Microsoft, they never will, unless they let go of\n  the myth that Microsoft has made using computers easy to use.  in fact,\n  the only thing that Microsoft has made _real_ easy for their users is\n  handing over lots and lots of money to Microsoft in exchange for more\n  hype to believe in, more vaporware to wait for, and most of all, more\n  vehicles for viruses to get scared into bying more software to avoid.\n\n  don't follow up to this article until you have found and tried at least\n  three different IDE-based Common Lisp environments and have decided to\n  fail to complain about them.  thank you for your cooperation.\n\n#:Erik\n\n",
  "date": "2000-02-14",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}