{
  "url": "https://www.xach.com/naggum/articles/3160831734652382@naggum.no.html",
  "id": "3160831734652382@naggum.no",
  "title": "Re: Private message received from EN",
  "content": "\nSubject: Re: Private message received from EN\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/02/29\nNewsgroups: comp.lang.lisp\nMessage-ID: <3160831734652382@naggum.no>\n\n* \"Janos Blazi\" <jblazi@netsurf.de>\n| Erik, I apologize for that.  Of course I believe you.  Please take my word of\n| honor that I did not do it intentionally.\n\n  that is by now irrelevant, since you posted my reply to you.  no apology\n  can ever be accepted from people who take revenge first and apologize\n  later, since they will repeat the act of revenge the next time, too.\n  viz, your posting it here _was_ intentional and typical of your blind and\n  phenomenally stupid destructiveness.  there is no way you can make amends\n  for this action, but you can realize that you are so stupid you must shut\n  up to avoid getting into even more trouble.  can you do that?  NOW?\n\n| Of course I did not like the content of you message.\n\n  you're a blathering idiot, Janos.  that you don't like something or feel\n  hurt is not and never can be a carte blanche for the kind of braindamaged\n  and uncontrollable destructiveness that is the core of your personality.\n\n  and your word of _honor_?  who the hell do you think you are fooling?\n  you're the least _honorable_ person I haver ever had the displeasure to\n  deal with.  a worse hypocrite than you has never posted anywhere I have\n  read anything.  a purported fan of _tolerance_ who is so mind-bogglingly\n  irrational in his destructiveness when it is precisely his tolerance that\n  is demanded can have no honor at all, because he only wants _others_ to\n  tolerate his vile actions.  you can't change this by now, Janos.  we all\n  know exactly what you're made of, now, and all you can do is put a lid on\n  it, and die with the shame of knowing that you have been fully exposed.\n\n#:Erik\n\n",
  "date": "2000-02-29",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}