{
  "url": "https://www.xach.com/naggum/articles/3160678127233294@naggum.no.html",
  "id": "3160678127233294@naggum.no",
  "title": "Re: Allegro CL 5.0 Win32",
  "content": "\nSubject: Re: Allegro CL 5.0 Win32\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/02/27\nNewsgroups: comp.lang.lisp\nMessage-ID: <3160678127233294@naggum.no>\n\n* David Thornley\n| What was unfortunate about it was that some people don't speak American,\n| misunderstood, and attacked.  What was even more unfortunate about it is\n| that some people kept insisting, in their extreme arrogance, that they\n| knew what was meant by an unfamiliar turn of phrase, and kept attacking.\n\n  what's even more unfortunate is that some people think they know what\n  went on and make no bones about expanding on their personal take on it,\n  even though the core problem they attribute to others is the _mistake_ of\n  thinking they know what went on and not backing down in the presence of\n  counter-evidence.  the extreme arrogance of such fools to pretend they\n  have The Answer is indeed the cause of these conflicts.  if the arrogant\n  fools had been willing to listen and understand, the number of idoitic\n  assumptions would perhaps have been managably small.  instead we have\n  people who are so incredibly thick-headed as to post their imagination of\n  what my days are like, and now David Thornley exceeds this idiotic drivel\n  by some other drivel about somebody misunderstanding \"copy\".  geez.\n\n  when people of so little introspective ability make grand projections\n  about the behavior of others, the only result is that we learn how they\n  think, and learn _nothing_ about anything else.  it's _really_ pathetic.\n\n| Erik assumed the worst, and (as of the last I've seen his postings)\n| continues to do so.\n\n  and just what would it take to provide you with counter-evidence, David?\n  your willingness to make and post your assumptions from _zero_ evidence\n  goes way beyond what I _questioned_ Zachary about.  I don't think you\n  even have the right to complain as long as your assumption-generator is\n  going at full speed.\n\n  what actually _amuses_ me in these discussions is just how idiotic the\n  people who complain about my behavior are.  it is clearly impossible for\n  these clowns to behave reasonably and intelligently themselves, and so\n  they make all these completely bizarre assumptions and projections and\n  tell me about their personal life (which I have _zero_ interest in!) and\n  how they imagine something they couldn't possibly be correct about.  is\n  there any wonder I keep up the flaming of these disgusting _retards_?\n  every time one of these blathering losers proves that he deserves it, I'm\n  proven right: one more true idiot marked out.\n\n  what's unfortunate is that the morons think their way of thinking is the\n  only possible way to think, but that's typically what _defines_ a moron.\n\n#:Erik\n\n",
  "date": "2000-02-27",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}