{
  "url": "https://www.xach.com/naggum/articles/3160533150935433@naggum.no.html",
  "id": "3160533150935433@naggum.no",
  "title": "Re: Allegro CL 5.0 Win32",
  "content": "\nSubject: Re: Allegro CL 5.0 Win32\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/02/26\nNewsgroups: comp.lang.lisp\nMessage-ID: <3160533150935433@naggum.no>\n\n* \"Janos Blazi\" <jblazi@netsurf.de>\n| I think that the tone is getting harsher in this newsgroup due to EN's\n| fierce attacks and this is a very bad thing.\n\n  then do your own piece and cut your own tone.  you can't cut mine, but\n  you might be very surprised, especially considering your personality,\n  that some people don't go around with thoughts of revenge all the time\n  and that hatred and malice have no part of _their_ personality, even\n  though _you_ are filled to the brim with both.  if you don't annoy and\n  harrass people, they don't react to you, either.  instead you, and Xah\n  Lee, and this Larry dude recently, behave as if your thinking is you have\n  a _right_ to annoy me in particular and think that the more you annoy me,\n  the more right you get in doing whatever it was you were once critized\n  for, that if you can somehow _prove_ I'm \"bad\" to people, as opposed to\n  what I really am: really harsh on stupidity, you don't have to listen to\n  the arguments I present that you have made some very serious mistakes\n  that reflect badly on you.  that is not how things work, because such is\n  the actual ad hominem argument, and you're the stupid jerks making it.\n  you can _never_ invalidate the argument by going for the person, but you\n  can make the _person_ change his ways if the person makes particular\n  mistakes through sloppiness or carelessness which produces bad arguments,\n  which means the argument may get improved if the person gets the point of\n  the message \"pull yourself together\", but you guys are so confused about\n  this and refuse to think, instead defending your intellectual sloppiness\n  and going on a rampage with hostilities towards those who show you that\n  you don't use your brain, and thereby you only prove you don't have any.\n\n  stupidity is the result of not being required to think, or believing one\n  can get away with not thinking.  I don't tolerate stupidity at all, but I\n  actually believe that stupidity is worse, and reflects worse on people's\n  personality, than malice, but the two combined, as in Janos Blazi, is too\n  much.  note that stupidity has nothing to do with intelligence or lack\n  thereof, it has to do with insufficient expenditure of mental effort as\n  required by the task at hand.  intellectual laziness is the only sin.  I\n  punish such sinners, and like any sinner who knows he is one and has no\n  intention of changing his ways, Janos Blazi and his like-minded ilk need\n  to defend themselves rather than stop sinning, which means they will use\n  any evil means and unlimited malice to try to stop the criticism, apart\n  from using their brains and realize that they _could_ just start to think\n  and not post idiotic drivel that wastes everybody's time.  apparently, it\n  is just too much to demand of Janos Blazi that he do that, and he has all\n  the time in the world to attack me and vilify me and shower me with his\n  idiotic malice, instead.  what more proof do I need of who Janos Blazi is?\n\n  and now he complains about the tone.  he can fix his own.  it would help\n  a lot, and I certainly wouldn't dream of speaking badly of someone who\n  has stopped attacking me, but someone who keeps attacking me with a tone\n  so malicious as Janos Blazi's and who is so demented as to complain about\n  the tone of _others_, should have been taken care of by the mental health\n  services and just be locked up.  the only way you could possibly have any\n  credibility when you criticize something is to stay above it, and the\n  more you stay above it, the more you show it possible to do without it.\n  if you have to engage in the same thing you want others to stop in the\n  belief that this will stop them, you're just an idiot who doesn't like\n  _who_ uses a particular means.  so why prove you're an idiot when that is\n  what the criticism was all about?  don't you morons realize that when I\n  think you're idiots, you do nothing but prove my case with your behavior?\n  what do you _think_ you could possibly accomplish with that?\n\n  Janos Blazi, it is obvious by now that you are beyond reach, and you seem\n  to be retarded or at least psychotic if not, which means there's no point\n  in trying to reach you, either, but if you wish for a better tone in this\n  newsgroup, you could do your part and stop attacking _me_ all the time.\n  get an argument about _something_ for once -- don't obsess about people.\n  it's your obsession with people that causes your problems with the fact\n  that others are concerned about actions, principles, and ideas, because\n  you can't see beyond people, but people are uninteresting except to their\n  close ones.  and you're not close to me, if that needs stressing, so it's\n  what you do and what you argue through your actions is true and good that\n  is of my concern.  what you seem to argue is true and good is stupidity,\n  the right to be intellectually lazy, the right to make false accusations\n  and claims, the right to distort arguments and be ridiculously stupid in\n  not understanding them, etc.  you're the champion of any idiot around who\n  doesn't want to be told it's not OK to be an idiot.  we're going to have\n  to disagree on that, to put it mildly, but you're not going to convince\n  me it's OK to be an idiot the way you go about it.\n\n  sigh, I don't seem to learn, either, talking sense to Janos Blazi.\n  \n#:Erik\n\n",
  "date": "2000-02-26",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}