{
  "url": "https://www.xach.com/naggum/articles/3161063348163784@naggum.no.html",
  "id": "3161063348163784@naggum.no",
  "title": "Re: [executables] was: why Haskell hasn't replaced CL yet?",
  "content": "\nSubject: Re: [executables] was: why Haskell hasn't replaced CL yet?\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/03/03\nNewsgroups: comp.lang.lisp\nMessage-ID: <3161063348163784@naggum.no>\n\n* kc5tja@garnet.armored.net (Samuel A. Falvo II)\n| >Happy now?\n|  ^^^^^^^^^^\n| \n| Yet another person who indulges in personal attacks and can't control his\n| temper.\n\n  how about you?  if you can't control your reactions to a \"happy now?\"\n  maybe the simple fact of the matter is that the problem _is_ with you,\n  and not with anything else at all.  you know, this happens a lot in real\n  life, so it's not particularly surprising that it happens on the Net.\n\n| With people like this promoting the language, is it any wonder that LISP\n| has little press these days outside of academia?\n\n  see, this is a fairly insulting personal attack, but fortunately, we know\n  from the history of just about everything that only clueless morons come\n  up with this shit, so nobody has to deal with it except to laugh at you.\n\n  in case you need spoonfeeding, too: we're responding to your \"arguments\"\n  and attitude problems, we're not promoting the language.  if you think\n  you are engaging people in a \"promote the language\" debate with your\n  silly misgivings about the measurements, you're even more arrogant than\n  anybody here probably thinks right now.\n\n| Tone your voice down, will you?\n\n  great idea!  hey, maybe you could show us with your excellent example\n  behavior?\n\n| I did nothing to warrent your wrath.\n\n  in your own eyes, obviously, but since when do people's reactions to you\n  depend (especially solely) on what _you_ think you did?  come on, now,\n  show some _insight_ into human behavior if you want to be the critic.\n  matter of fact, if you see somebody angry at you, the first thing to do\n  is consider the question: \"what did I do?\", _not_ \"I don't deserve this!\"\n  and go self-defensive.  however, if you actually react with a \"I don't\n  deserve this!\" what the hell were you thinking when you lashed out at\n  others -- they clearly didn't deserve it in their own eyes, either, and\n  they certainly did _nothing_ to warrant your idiotic comment about\n  promoters of the language.\n\n  I find it utterly fascinating that the people who make so much fuss about\n  other people's temper have no control over their own and have so much\n  less into these things than those who _can_ control their temper and\n  direct it specifically at targets that _do_ deserve it.  watch these guys\n  when they defend themselves!  it's _ridiculous_ how unfocused they become\n  and how willing they are to drift away from any topic at all.  this leads\n  me to conclude that we're looking at people who lack the ability to deal\n  with conflict in general, and who spend their life avoiding conflict in\n  any form, only to be _really_ upset when others don't share their views,\n  and then they behave as rank amateurs in any conflict they get into.\n\n#:Erik\n\n",
  "date": "2000-03-03",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}