{
  "url": "https://www.xach.com/naggum/articles/3161063857499252@naggum.no.html",
  "id": "3161063857499252@naggum.no",
  "title": "Re: [executables] was: why Haskell hasn't replaced CL yet?",
  "content": "\nSubject: Re: [executables] was: why Haskell hasn't replaced CL yet?\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/03/03\nNewsgroups: comp.lang.lisp\nMessage-ID: <3161063857499252@naggum.no>\n\n* Samuel A. Falvo II\n| What part of this didn't you understand?\n\n  why you can't figure out that start-up time from storage media is utterly\n  and completely irrelevant when you start 50 processes within the same\n  second.\n\n  incidentally, I consider your question an instance of losing your temper.\n  control your own temper, you hypocrite, or shut up about that of others!\n\n| The only point I saw was that you can launch 2 copies of ACL 25 times a\n| second each.\n\n  this is obviously an unwarranted conclusion on your part, since it took\n  1.5 second user+system time and 1 second real time, and only user+system\n  matters.  you have no data to support your conclusion, but you do have\n  data to support that I could fire up 33 instances a second on one CPU\n  from this data.  so I just wish you could engage your brain before you\n  engage your agenda.\n\n| Are you for real?  Why are you getting so upset?  Why can't you conduct\n| yourself like an adult?  What did I do to deserve the personal attacks on\n| me by you?  Where have I attacked you?  And what did I attack you with?\n\n  you're being obnoxious, stupid, impenetrably dense, and behave like an\n  asshole with an irrelevant axe to grind.  that's what I object to.  and\n  now you can't even control your own temper.  how sickeningly _pathetic_.\n\n| All I did was point out that there were ambiguities in the measurements made\n| due to certain \"basic\" assumptions.  I'm not interested in the theoretical\n| performance of ACL.  I'm interested in the real-world, down-to-Earth,\n| in-the-trenches performance of ACL.\n\n  and that's what you got, dude.  now, will you _ever_ be satisfied?\n\n#:Erik\n\n",
  "date": "2000-03-03",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}