{
  "url": "https://www.xach.com/naggum/articles/3162156255970575@naggum.no.html",
  "id": "3162156255970575@naggum.no",
  "title": "Re: Who used the \"D\" word?",
  "content": "\nSubject: Re: Who used the \"D\" word?\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/03/16\nNewsgroups: comp.lang.lisp\nMessage-ID: <3162156255970575@naggum.no>\n\n* Coby Beck <cbeck@mercury.bc.ca>\n| This is rather ironic considering the source.\n\n  it's stuff like \"considering the source\" that defines \"ad hominem\", dude.\n\n  don't you at least find it kinda funny that you're the one committing\n  this error in argument while you're _pretending_ to be concerned about\n  proper form and expression?  you know, here's my understanding of why you\n  react: it has to be \"unpleasant\" for you to react to something, while\n  \"pleasant\" insults and ad hominems are perfectly OK, indeed so OK that\n  you find yourself more than willing to use them to \"fight\" unpleasantness.\n\n| But i don't think a certain level of meta-discussion is out of line when\n| so many very bad feelings fly around in any group of people.\n\n  be a smart lad, now, and consider the _overwhelming_ probability that the\n  \"bad feelings\" _you_ see are figments of _your_ imagination and artefacts\n  of how _you_ interact with the world and thus imagine that others do,\n  too.  basically, the only serious mistake you can make about other people\n  is to believe you can put yourself in their place.  moralism is all about\n  making this mistake and being self-righteous about it.\n\n  a piece of advice, though, since you're into this bad feelings business:\n  just because you, a bystander, feel obliged to feel bad on behalf of\n  someone else, doesn't mean anyone else is actually feeling anything like\n  you do, particularly not anyone who is actually _involved_ in what you're\n  just looking at and not understanding because you're responding to them\n  by _purely_ emotional means (which is, before you deny it, evidenced by\n  the lack of _anything_ outside of your displeasure with the form that\n  causes your negative reactions).  you thereby _introduce_ bad feelings\n  into this frail equilibrium.  which is really brilliant, since it proves\n  your point and virtually removes the possibility of proving you wrong,\n  which moralists get _so_ immensely upset when they are, which makes them\n  even more eager to project their dismal world view on everybody else.\n  \n#:Erik\n\n",
  "date": "2000-03-16",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}