{
  "url": "https://www.xach.com/naggum/articles/3162629683063483@naggum.no.html",
  "id": "3162629683063483@naggum.no",
  "title": "Re: strings and characters",
  "content": "\nSubject: Re: strings and characters\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/03/21\nNewsgroups: comp.lang.lisp\nMessage-ID: <3162629683063483@naggum.no>\n\n* Barry Margolin <barmar@bbnplanet.com>\n| Wouldn't those characters be of type CHARACTER?  Mustn't a vector\n| specialized to type CHARACTER be able to hold all objects of type\n| CHARACTER?  Isn't such a vector a subtype of STRING?\n\n  what was the _intent_ of removing string-char and making fonts and bits\n  implementation-defined?  has that intent been carried forward all the way?\n\n| Where does the standard ever give license for a value to change during\n| assignment?\n\n  16.1.2 Subtypes of STRING, and I qoute:\n\nHowever, the consequences are undefined if a character is inserted into a\nstring for which the element type of the string does not include that\ncharacter.\n  \n| Well, I was there and you weren't, so I think I can comment on the intent,\n| to the best of my recollection.\n\n  that's appreciated, but I must say I find \"I was there and you weren't\"\n  to be amazingly childish as \"arguments\" go.\n\n| What we wanted to remove from the standard were the API and UI that dealt\n| with the nature of specific attributes.  We didn't want to distinguish\n| these specific attributes (bits and fonts), which often didn't make sense\n| in many implementations or applications.  But I don't think we intended\n| to destroy the notion that attributes are part of the objects, and are\n| thus included in assignments just like any attributes and slots of other\n| data types.  They could get lost during I/O, due to the fact that the\n| language can't specify the nature of external file formats, but as long\n| as you stay within the Lisp environment they should stick.\n\n  perhaps you, who were presumably there for the duration, could elaborate\n  on the intended _consequences_ of the removal of the string-char type and\n  the change to strings from being made up of a subtype of character that\n  explicitly excluded fonts and bits to a character type that didn't need\n  to include fonts and bits?\n\n#:Erik\n\n",
  "date": "2000-03-21",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}