{
  "url": "https://www.xach.com/naggum/articles/3163031395198264@naggum.no.html",
  "id": "3163031395198264@naggum.no",
  "title": "Re: Dangling Closing Parentheses vs. Stacked Closing Parentheses",
  "content": "\nSubject: Re: Dangling Closing Parentheses vs. Stacked Closing Parentheses\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/03/26\nNewsgroups: comp.lang.lisp\nMessage-ID: <3163031395198264@naggum.no>\n\n* David J. Cooper\n| The \"discussion\" has started going around in circles -- he gives his many\n| reasons (\"things are easier to insert\" \"it is closer to other languages\n| like C and C++\" etc.), but most of all his main claim is that there is no\n| \"official standard\" which says parens are to be stacked like this in\n| Lisp, so he will write his code as he pleases, thank you very much.\n\n  you can't argue for _or_ against excessive whitespace on these grounds.\n  at issue is the relative importance of the delimiters.  in C, the block\n  structure is very important and the visual clues in indentation are not\n  sufficiently perspicuous that they can be trusted for anything, so { and\n  } delimiters get extremely visually apparent formatting characteristics,\n  such as their own lines.  in Common Lisp, the list structure is much less\n  important than the indentation, and the perspicuity of normal indentation\n  rules is sufficiently high that the parens are mainly used there for the\n  machine to use, not humans.  therefore, humans would tend to get parens\n  in CL out of the (visual) way, while the braces in C must be very visible.\n\n  different languages have different optimization parameters for almost\n  every facet of their expression.  trying to optimize CL code layout with\n  the parameters from C is completely braindamaged and merits nothing but a\n  snort, and people who are _that_ underdeveloped in their understanding of\n  the differences between languages should just be sedated and put away.\n  \n  community standards grow out of such pragmatic optimization parameters,\n  and can't _actually_ be defended by reference to authority, because one\n  has to trust the authority to be representative of the community.  one\n  must instead seek to understand how they got the way they are, and why\n  there may be minority and majority communities, as well.  (a community of\n  one may be a brilliant loner or a nutcase, and it's hard to tell which is\n  which.)  I think the need to understand how things came to be applies to\n  everything, but retracing the steps of decisions made by large groups of\n  people is usually quite depressing, so there is wisdom in accepting the\n  authorities at times.  yet, accepting or rejecting authorities _because_\n  they are authorities is really retarded and people who are prone to this\n  should also be sedated and put away.\n\n#:Erik\n\n",
  "date": "2000-03-26",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}