{
  "url": "https://www.xach.com/naggum/articles/3164660350780584@naggum.no.html",
  "id": "3164660350780584@naggum.no",
  "title": "Re: Loop Syntax",
  "content": "\nSubject: Re: Loop Syntax\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/04/14\nNewsgroups: comp.lang.lisp\nMessage-ID: <3164660350780584@naggum.no>\n\n* Erik Naggum\n| sigh.  just get over it, Tom.  I don't like being so important in some\n| dreadful morons' lives as I am in yours and this \"Courageous\" fellow.\n\n* Courageous <jkraska1@san.rr.com>\n| Given the long chains of invective, cursing, put downs, and outright\n| temper tantrums I've been subject to one both usenet and long personal\n| email messages -- and the apologetic email I've received from the group\n| explaining that you have an established tendancy to behave the way you do\n| (were you aware that people thought of you that way?)     ... *well*.\n\n  you missed the relevant part, of course.  _you_ make me important in\n  _your_ lives.  you don't have to, yet you complain bitterly when you do,\n  and you refuse to understand that it's your very own choice to do so.\n\n  when your have reached the point in your life when _you_ become important\n  to yourself the way I am to you now, you will thank me, in your own way.\n  until then, you will hate me, or something more or less indistinguishable\n  from hate.  _that_ is the established tendency.  of course, you won't\n  believe this now, but that's _why_ I'm important to you: you _need_ to be\n  preoccupied with me and you _need_ to continue to post so much insane\n  drivel about me from inside your _own_ psyche it will make you very, very\n  embarrassed when you realize what you've done, instead of the simple and\n  easy thing you _could_ do, but which _you_ only tell other people as a\n  piece of advice you'll never follow yourself: look inside yourself.\n  there's something inside you that makes me important to you.  find it!\n\n  understandably, however, you are right now at the point where the only\n  thing that matters to you is to keep enlightenment from occuring to you,\n  and the more you can preoccupy yourself with _me_, the less you will be\n  enlightened.  once you understand, fundamentally, emotionally, and fully\n  that spending any energy at all on other _people_ is a matter of choice\n  that reflects concern, personal bonding, and apprecation for something\n  you often do not understand when it happens, you will be prepared to let\n  go of _people_ and focus on _ideas_, which will enable you to concentrate\n  on those few people that _really_ matter to you, as you will know why.\n\n  however, I don't want anything to do with _you_, yet this very rejection\n  is what drives you like a madman to keep sending me mail that is also\n  rejected, keep replying to articles, keep _preoccupying_ yourself with\n  me.  I want you morons to shut up and _listen_, not to _me_, but to _any_\n  source of englightenment you can find that will cause you to grow up and\n  relieve me of the burden of having to reject your pathetic attempts to\n  ingratiate yourself with me.  it's not _about_ me, you morons, it's about\n  what I trigger _inside_ of you, whatever the hell it is -- I wish I knew,\n  because then maybe I could get a little _control_ over your sycophants,\n  like perhaps giving me all your money, but I'm joking, of course.\n\n  and if you found this nauseating enough to read that you stop stalking me\n  with your sniveling little \"please love me!\" messages, so much the better!\n  I shall appreciate it highly when you reach enlightenment, as interaction\n  between the enlightened is always such a pleasure, but until then, you're\n  nothing but an ignorent, annoying pest attracted to the nearest source of\n  light.  seek elsewhere, you moths-for-brains, but above all: seek!\n\n#:Erik\n-- \n  statistically, only 1 in 250 people understood anything in this message.\n\n",
  "date": "2000-04-14",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}