{
  "url": "https://www.xach.com/naggum/articles/3164777262564002@naggum.no.html",
  "id": "3164777262564002@naggum.no",
  "title": "Re: Deep copy in lisp: how?",
  "content": "\nSubject: Re: Deep copy in lisp: how?\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/04/15\nNewsgroups: comp.lang.lisp\nMessage-ID: <3164777262564002@naggum.no>\n\n* Courageous <jkraska1@san.rr.com>\n| However, it's funny. At my place of work, I'm the one all the newbies\n| come to for answers, because I understand ...\n\n  I'm sure you think you're the hero of your work-place, but it doesn't\n  help just to _tell_ people when you have done so much damage to your\n  public impression as you have, and as a line of self-defense, it's so\n  pathetic it stinks.  _anyone_ could write a self-serving self-appraisal.\n  that's why people _don't_ write such personal defenses on the Net -- it's\n  self-defeating and on top of it, it's embarrassing when those \"newbies\"\n  who came to you for answers ask you something you don't know and search\n  for the answer on the Net, only to find that you don't have a clue in\n  some very important areas and are incredibly self-defensive and personal\n  about it.  to really top it off, you haven't understood _any_ of the many\n  very good explanations you have received to your question.  such arrogant\n  ignorance is a very questionable quality in an employee who doles out\n  answers to helpless \"newbies\" in an organization.  so you should start to\n  worry about yourself, and much less about others: if you can't take care\n  of yourself, you certainly are in no position to give advice to others.\n\n| More rhetorically, I wonder if the people over at Franz will be \"morons\"\n| if they attempt to implement the Objects By Value section of the CORBA\n| standard in their ORBLink product?\n\n  why do you want to hurt yourself so much?  you didn't have to _prove_\n  that you still have not understood the difference between implementing a\n  carefully constrained specification of a protocol and _general_ deep\n  copier, did you?  normal people don't insist on making the same mistake\n  over and over just because they don't like being called morons when they\n  do and continue with it until they are no longer called morons (it works\n  the other way around, in case you wonder).  the people over at Franz have\n  understood this difference long ago (like at _least_ 15 years ago), and\n  are in no danger at all of being called morons.  and in case you wonder\n  about more things, smart people who don't defend themselves can disagree\n  violently without even the hint of a danger of getting personal, so even\n  if implementing CORBA _were_ a really moronic thing to do, that itself\n  doesn't mean someone who does it is a moron.  it's the getting _personal_\n  that is the first hint of someone being a moron.  you have never quit\n  giving that hint, on the contrary: you have reinforced it over and over,\n  and this is a pretty strong argument that it is a correct assessment of\n  your mental acuity and childish, retarded stubbornness.  you can change\n  this by snapping out of your \"personal\" mental state and realize that\n  your ego is not under attack from anyone other than your own imagination.\n  most everyone here will utter a sigh of relief if you get the idea, and\n  nobody will ever \"remind\" you of your past mistake when you have learned\n  -- that's what makes possibly heated technical discussions _impersonal_\n  to people who aren't morons.\n\n  I'm _expecting_ another knee-jerk moronic response.  surprise me.  (of\n  course, now that I said that, your childish stubbornness prohibits you\n  from showing any trace of adult, smart behavior, but try, anyway.)\n\n#:Erik\n\n",
  "date": "2000-04-15",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}