{
  "url": "https://www.xach.com/naggum/articles/3165302496305278@naggum.no.html",
  "id": "3165302496305278@naggum.no",
  "title": "Re: Deep copy in lisp: how?",
  "content": "\nSubject: Re: Deep copy in lisp: how?\nFrom: Erik Naggum <erik@naggum.no>\nDate: 2000/04/21\nNewsgroups: comp.lang.lisp\nMessage-ID: <3165302496305278@naggum.no>\n\n* Courageous <jkraska1@san.rr.com>\n| One of the hallmark signs of an abuser is blaming the victim.\n\n  the hallmark of a loser is one who has thoughts of \"blame\" and \"victim\"\n  and \"abuser\" and all that shit and who seems himself in one particular\n  role relative to others.  snap out of it!\n\n  no one is blaming you for anything.  you are simply being told that your\n  actions have certain consequences.  you seem to subscribe to this view,\n  yet refuse to apply it to yourself.  I find this highly indicative of\n  what I have concluded about you.  you have been told that if you don't\n  want the consequences, you should change the actions.  you refuse to\n  change your pattern of being a hapless victim and go on and on and on\n  about everything bad happening to you being my fault.  you victimize\n  _yourself_ and work very hard to _remove_ responsibility from yourself.\n  such is the hallmark of a loser without hope of recovery, but I think\n  that has been the fairly well established pattern from you already.\n\n  the problem with you is you can't stop feeling the victim, even when it's\n  clear that you're running after _me_ with your unceasing desire to blame\n  me for your _personal_ problems.  I'm not responsible for your reactions.\n  you have to accept responsibility for your own _part_ in everything that\n  happens to you and not try to shift it to somebody else.  doing so is,\n  indeed, highly indicative of what I have already concluded about you.\n\n  the big test is whether you get over this.  so far, you have not, and\n  neither has Tom Breton and a few other \"victims\".  they have another\n  thing in common: all been very seriously mistaken in some particular\n  area.  I find it very interesting that being persistently wrong about\n  something causes _some_ people to fall into the \"victim\" trap (in their\n  own mind) and never get out of it, while those who want to understand\n  accept technical counter-information the first time it is presented and\n  _learn_ from it.  people who refuse to learn, however, fall into another\n  category which is unlikely to be respected for much, and even less when\n  they start to blame others and use \"I'm a victim!\" language.\n\n  I now understand why you need to _call_ yourself \"Courageous\".\n\n#:Erik\n\n",
  "date": "2000-04-21",
  "author": "Erik Naggum",
  "references": [],
  "source": "naggum"
}